# -*- coding:utf-8 -*-
# from dotadata_mining_banpick import Ban_Pick
# instance=Ban_Pick()
# print (instance.match_url,"比赛实时列表长度:",len(instance.match_url))
# radiant_full,dire_full,rname,dname=instance.get_kuaikegame()#get_vpgame()
# print(radiant_full,dire_full,rname,dname)




hero=["矮人直升机|矮人|工匠|5","谜团|元素|术士5","潮汐|娜迦|猎人|5","工程师|地精|工匠|5","船长|战士|人类|4","美杜莎|娜迦|猎人|4","圣堂|刺客|精灵|4","光之守卫|法师|人类|4","炼金|地精|术士|4","dk|骑士|人类|龙|4","利爪|德鲁伊|野兽|4","巨魔战将|战士|巨魔4","末日守卫|战士|恶魔|4","死灵|亡灵|术士|4","干扰者|兽人|萨满|5","巫医|巨魔|术士|1","剑圣|战士|兽人|2","影魔|恶魔|术士|3","火枪|矮人|猎人|3","幻影|刺客|精灵|3","斯拉克|娜迦|刺客|3","风行者|精灵|猎人|3","剃刀|元素|法师|3","火女|人类|法师|3","死亡|骑士|亡灵|3","全能|人类|骑士|3","灵魂守卫|恶魔|恶魔猎手|3","沙王|虫|刺客|3","剧毒|野兽|术士|3","狼人|人类|野兽|战士|3","毒龙|龙|刺客|3","变体精灵|刺客|元素2","痛苦女王|恶魔|刺客|5","冰女|人类|法师2","混沌|恶魔|骑士2","兽王|兽人|猎人|2","撕拉达|娜迦|战士|2","伐木机|地精|工匠2","仙女|精灵|法师2","先知|精灵|德鲁伊|2","大树|精灵|德鲁伊|3","小小|元素|战士|1","发条|地精|工匠|1","海民|野兽|战士|1","小黑|亡灵|猎人|1","蓝胖|食人魔|法师|1","小鹿|野兽|德鲁伊|1","斧王|兽人战士1","赏金|地精|刺客|1","蝙蝠|巨魔|骑士|1","修补匠|地精|工匠|1","萨满|巨魔|萨满|1|","敌法|精灵|恶魔猎手|1","卡尔|精灵|法师|5","陈|兽人|牧师|4","宙斯|神|法师|5","双头龙|龙|法师|5","斯温|恶魔|战士|5","大圣|野兽|武僧|5","圣堂||刺客|5","潮汐|娜迦|猎人|5","死亡先知|亡灵|术士|5"]